package Chapter10;

import javax.swing.JOptionPane;

public class test {
	
	// 기본 설정 7가지
	
	
	// (1. JLabel 생성) ////////////////////////////////////////////////////////////////
			// 1-1. 이미지 레이블 생성
			
	
	
	
			// 1-2. 문자열 레이블 생성
	
	
	
			// 1-3. 이미지 + 문자열 레이블 생성
	
	
	
				
	// (2. JButton 생성) ///////////////////////////////////////////////////////////////
			
			// 버튼 이미지 삽입
	
	
	
			// 버튼 상태에 따른 이미지 변화(디폴트, 마우스가 올라가 있는 상태, 버튼을 누른 상태)
			
	
	
			// 버튼 이벤트 처리
		
	// - 버튼 관련 메소드 (버튼 못쓰게 하기?)


	
	// (3. JCheckBox 생성) /////////////////////////////////////////////////////////////
			// 체크박스 배열 처리
	
	
	
	
	
	
	
			
	// (4. JRadioButton 생성)  /////////////////////////////////////////////////////////
			// 버튼 그룹 객체 생성
			
			// 라디오버튼 배열 생성
	
			//버튼그룹에 라디오버튼 삽입
	
	
	
	
	
	
	// (5. JTextField 생성)  ///////////////////////////////////////////////////////////
			
			// 버튼 이벤트 처리
	
	
	
	// (6. JTextArea 생성)  ////////////////////////////////////////////////////////////
	
			// 스크롤바 생성
	
	
	
	// - JTextField와 JTextArea 공통으로 알아야되는 메소드
			// ta.
			// tf.
			// tf.
	
	// (7. JList<E> 생성)  /////////////////////////////////////////////////////////////
			// 배열 생성
	
			
			
	
	// (8. JComboBox<E> 생성)  /////////////////////////////////////////////////////////
			// 배열 생성
	
	
	
	
	// (9. JMenuBar 생성)  /////////////////////////////////////////////////////////////
			// 메뉴바 생성
	
			// 메뉴 생성
	
			// 메뉴 아이템 생성

	
			// 메뉴 아이템 삽입

	
	
			// 메뉴 삽입

			// 메뉴바 삽입
	
	
	// (10. JOptionPane 생성) ///////////////////////////////////////////////////////////
			// (1) 입력 다이얼로그
			
			// (2) 확인 다이얼로그
			
	
	
	
			// (3) 메시지 다이얼로그

	
	public static void main(String[] args) 
	{
		
	}

}
